sample=[41, 46 47 47 48 50 50 50 50 50 50 50 48 50 50 50 50 50 50 50 52 52 53 55 50 50 50 50 52 52 53 53 53 53 53 57 52 52 53 53 53 53 53 53 54 54 55 68];
vars=var(sample);
means=mean(sample);
[h,p,c0]=vartest(sample,vars);
disp(['Διάστημα εμπιστοσύνης για διασπορά:','[',num2str(c0(1)),',',num2str(c0(2)),']']);
[h2,p2,c2]=vartest(sample,25);
if 25>c2(1) && c2(2)>25
    disp('σ=5 δεκτή υπόθεση');
else 
    disp('σ=5 δεν είναι δεκτή υπόθεση');
end
[h1,p1,c1]=ttest(sample,means);
disp(['Διάστημα εμπιστοσύνης για μέση τιμή:','[',num2str(c1(1)),',',num2str(c1(2)),']']);
[h3,p3]=ttest(sample,52);
if 52>c1(1) && c1(2)>52
    disp('μ=52 δεκτή υπόθεση');
else 
    disp('μ=52 δεν είναι δεκτή υπόθεση');
end
[h4,p4,c4]=chi2gof(sample,"NBins",8);
if h4==1
    disp('Aπόρριψη προσαρμογής σε κανονική κατανομή');
else
    disp('Είναι πιθανό το δείγμα να προέρχεται απο κανονική κατανομή');
end