M=readmatrix('eruption.txt');
wait1=M(:,1);
dur1=M(:,2);
wait2=M(:,3);
% Πρώτο ερώτημα
[h1,p1,c1]=vartest(wait1,var(wait1));
[h2,p2,c2]=vartest(dur1,var(dur1));
[h3,p3,c3]=vartest(wait2,var(wait2));

disp(['Διάστημα εμπιστοσύνης για διασπορά χρόνου αναμονής 1989:','[',num2str(c1(1)),',',num2str(c1(2)),']']);
disp(['Διάστημα εμπιστοσύνης για διασπορα χρόνου διάρκειας 1989:','[',num2str(c2(1)),',',num2str(c2(2)),']']);
disp(['Διάστημα εμπιστοσύνης για διασπορά χρόνου αναμονής 2006:','[',num2str(c3(1)),',',num2str(c3(2)),']']);
disp(['       ']);
% Δεύτερο ερώτημα 
[hm1,pm1,cm1]=ttest(wait1,mean(wait1));
[hm2,pm2,cm2]=ttest(dur1,mean(dur1));
[hm3,pm3,cm3]=ttest(wait2,mean(wait2));

disp(['Διάστημα εμπιστοσύνης για μέση τιμή χρόνου αναμονής 1989:','[',num2str(cm1(1)),',',num2str(cm1(2)),']']);
disp(['Διάστημα εμπιστοσύνης για μέση τιμή χρόνου διάρκειας 1989:','[',num2str(cm2(1)),',',num2str(cm2(2)),']']);
disp(['Διάστημα εμπιστοσύνης για μέση τιμή χρόνου αναμονής 2006:','[',num2str(cm3(1)),',',num2str(cm3(2)),']']);

disp(['       ']);

% Τρίτο ερώτημα 
[hx1,px1,cx1]=chi2gof(wait1,"NBins",8);
[hx2,px2,cx2]=chi2gof(dur1,"NBins",8);
[hx3,px3,cx3]=chi2gof(wait2,"NBins",8);

disp([hx1,hx2,hx3]);

% Τα c_1,c_2 θα δώσουν τα διαστήματα εμπιστοσύνης
% ώστε να ελέγξουμε το σφάλμα για 10 λεπτά
sample1=wait1(find(dur1<2.5));
sample2=wait1(find(dur1>=2.5));


[h_1,p_1,c_1]=ttest(sample1,65);
[h_2,p_2,c_2]=ttest(sample2,91);

disp(['Διάστημα εμπιστοσύνης για μέση τιμη όταν η διαρκεια ειναι <2.5s:','[',num2str(c_1(1)),',',num2str(c_1(2)),']']);
disp(['Διάστημα εμπιστοσύνης για μέση τιμη όταν η διαρκεια ειναι >2.5s:','[',num2str(c_2(1)),',',num2str(c_2(2)),']']);